Revit 2026 API

# CurvedEdgeConditionParam Enumeration

---

The allowed values for the HOST_SSE_CURVED_EDGE_CONDITION_PARAM parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CurvedEdgeConditionParam
```
```vb
Public Enumeration CurvedEdgeConditionParam
```
```cpp
public enum class CurvedEdgeConditionParam
```
```fsharp
type CurvedEdgeConditionParam
```

| Member name | Value | Description |
| --- | --- | --- |
| ConformToCurve | 1 | Conform to curve |
| NotApplicable | 0 | Not Applicable |
| ProjectToSideFace | 2 | Project to side |

#### Reference

Autodesk.Revit.DB Namespace